Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: ཁོང་དུ་མི་འདྲུལ་བར་བགྱི་ལགས་ན། ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་བདག་རབ་ཏུ་འབྱུང་བ་དང་བསྙེན་པར་རྫོགས་པ་དགེ་སློང་གི་དངོས་པོ་འཐོབ་པ་ལྟ་ན།
en: I wish to go forth and be ordained a monk in the well-taught Dharma and Vinaya.

source: །དགའ་བོ་ཁྱོད་ཀྱིས་བདག་པོ་རྣམས་ལ་གནག་གཏད་དམ་བཙུན་པ་མི་འཚལ་ལགས་ཏེ།
en: “Nanda, have you entrusted the cattle to their owners?”

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: “O Honored One, I do not need to do that. Why?

source: བཙུན་པ་བ་རྣམས་ཀྱང་གཞོན་ལ་བེའུ་རྣམས་ཀྱང་ཚར་ལགས་ཏེ། སོ་སོའི་གནག་ར་འཚལ་བས་སོ་སོའི་གནས་སུ་མཆི་ལགས་པས།
en: O Honored One, since the cows are young and the calves are mature, and each of them knows its own cattle shed, each will go to its home.

source: བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་བསྙེན་པར་རྫོགས་པ་དགེ་སློང་གི་དངོས་པོ་འཐོབ་པ་ལྟ་ན།
en: I wish to go forth and be ordained a monk in the well-taught Dharma and Vinaya.

source: བདག་ནི་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཚངས་པར་སྤྱོད་པ་སྤྱད་པར་བགྱིའོ།
en: I will lead the pure life in the presence of the Blessed One.”

source: །དགའ་བོ་བ་རྣམས་ཀྱང་གཞོན་ལ་བེའུ་རྣམས་ཀྱང་ཚར་ཏེ་རང་རང་གི་གནག་ར་ཤེས་པས་རང་རང་གི་གནས་སུ་འགྲོ་བར་འགྱུར་མོད་ཀྱི།
en: “Nanda, since the cows are young and the calves are mature, and each of them knows its own cattle shed, each will go to its home.

source: འོན་ཀྱང་གནག་རྫི་ཟས་དང་གོས་བདག་གིར་བྱེད་པས་ནི་འདི་ལྟར་བདག་པོ་རྣམས་ལ་དེ་བྱ་དགོས་སོ།
en: But a herdsman who obtains food and clothing from the owners should do this for them.”

source: །དེ་ནས་གནག་རྫི་དགའ་བོས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་སོང་ངོ་།
en: Then Nanda, the herdsman, bowed low until his forehead touched the Blessed One’s feet, and he departed from the Blessed One’s presence.

source: །དེ་ནས་འཇིགས་སོ།
en: Thereupon, he began to run, crying loudly, “Fear!

source: །འཇིགས་སོ་ཞེས་སྒྲ་ཆེན་པོ་འབྱིན་ཅིང་བརྒྱུག་པར་བརྩམས་པ་དང་། ལམ་གྱི་བར་ནས་གནག་རྫི་ངོ་ཤེས་ལྔ་བརྒྱས་མཐོང་སྟེ་དེ་རྣམས་ཀྱིས་སྨྲས་པ། ཅི་ཞིག་གིས་འཇིགས། དེས་སྨྲས་པ།
en: Fear!” On the way, five hundred herdsmen who were his acquaintances saw him and asked, “Fear of what?”

source: སྐྱེ་བས་འཇིགས་སོ།
en: “Fear of birth;

source: །རྒ་བས་འཇིགས་སོ། །འཆི་བས་འཇིགས་སོ།
en: fear of old age; fear of death!”

source: །དེ་རྣམས་ཀྱང་དེའི་ཕྱི་བཞིན་དུ་བརྒྱུག་པར་བརྩམས་པ་དང་། གནག་རྫི་དང་། ཕྱུགས་རྫི་དང་། རྩྭ་ཐུན་དང་། ཤིང་ཐུན་དང་། ལམ་གྱིས་འཚོ་བ་དང་། ལམ་གོལ་བས་འཚོ་བའི་མི་གཞན་དག་ཀྱང་དེ་རྣམས་མཐོང་ནས་བརྒྱུག་པར་བརྩམས་སོ།
en: They, too, began to run, following after him. Seeing them, other herdsmen, shepherds, herb gatherers, wood gatherers, people who make a living properly, and people who make a living improperly began to run, following after them.

source: །ལམ་གྱི་མདུན་ནས་འོང་བ་རྣམས་ཀྱིས་དེ་དག་དེ་ལྟར་སྒྲ་འབྱིན་པ་མཐོང་ནས་དེ་རྣམས་ཀྱིས་དྲིས་པ། ཤེས་ལྡན་དག་འདི་ཅི་ཞིག །དེ་རྣམས་ཀྱིས་སྨྲས་པ། འཇིགས་སོ།
en: People on the way saw them crying and asked, “Sirs, what’s happening?” “Fear!” they answered.

source: །ཅི་ཞིག་གིས་འཇིགས།
en: “Fear of what?”

source: །རྒ་བས་འཇིགས་སོ།
en: fear of old age;

source: །འཆི་བས་འཇིགས་སོ།
en: fear of death!”

source: །དེ་རྣམས་ཀྱིས་ཀྱང་ཐོས་ནས་སླར་ལོག་གོ།
en: Having heard this, they turned back.

source: །ཇི་ཙམ་ན་རི་འོར་དང་ཉེ་བ་ཞིག་ཏུ་ཕྱིན་པ་དང་། དེ་ནས་རི་འོར་དེ་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་དེས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་མཐོང་ནས་སྔངས་པས་ཕན་ཚུན་དུ་འདོང་བར་བྱེད་དེ།
en: They came to a hamlet, and then the people living in the hamlet ran hither and thither, frightened to see the many people.

source: ཁ་ཅིག་ནི་བྲོས་སོ། །ཁ་ཅིག་ནི་རྫས་རྣམས་སྦེད་དོ། །ཁ་ཅིག་ནི་གོ་བགོས་ནས་འདུག་གོ།
en: Some escaped, some hid their things, some stood in armor.

source: །མི་དཔའ་བོ་གཞན་དག་ཅིག་ཡོད་པ་དེ་དག་གིས་བསུ་ནས་དྲིས་པ་ཤེས་ལྡན་དག་འདི་ཅི་ཞིག །དེ་རྣམས་ཀྱིས་སྨྲས་པ། འཇིགས་སོ།
en: Some brave men approached the people and asked, “Sirs, what’s happening?” “Fear!” they answered.

source: །དེ་ནས་རི་འོར་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་དེ་བག་ཕེབས་སོ།
en: Then the inhabitants of the hamlet were relieved.

source: །དེའི་ཚེ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་འཁོར་དེ་ཉིད་དུ་འདུས་ཤིང་འདུག་པར་གྱུར་ཏོ།
en: At that time the venerable Śāriputra was sitting in that very assembly.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་གནག་རྫི་དགའ་བོ་སོང་ནས་རིང་པོ་མ་ལོན་པར་རིག་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་ཅིའི་སླད་དུ་གནག་རྫི་དགའ་བོ་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བར་འཚལ་བ་བཟློག་སྟེ་སྡུམ་པར་བཏང་ལགས།
en: The venerable Śāriputra then asked the Blessed One, knowing that it had not been a long time since Nanda, the herdsman, had departed, “O Honored One, why did the Blessed One let Nanda, the herdsman, who wishes to go forth in the well-taught Dharma and Vinaya, go back home?”

source: ཤཱ་རིའི་བུ་གནག་རྫི་དགའ་བོ་སླར་ཁྱིམ་པ་ཁྱིམ་ན་གནས་པ་གང་ཡིན་པ་དེ་ནི་གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ།
en: “Śāriputra, it is impossible, out of the question, that Nanda, the herdsman, will dwell at home again as a layman.

source: སོགས་འཇོག་ཡོངས་སུ་སྤྱོད་པས་འདོད་པ་རྣམས་ལ་ལོངས་སྤྱོད་པར་འགྱུར་བ་དེ་ནི་གནས་མེད་དོ།
en: It is impossible that he will enjoy the objects of desire by hoarding.

source: །གནག་རྫི་དགའ་བོ་དེའུ་རེ་བདག་པོ་རྣམས་ལ་གནག་གཏད་དེ་འོང་བར་འགྱུར་ཞིང་། དེ་གང་གི་ཕྱིར་རིགས་ཀྱི་བུ་རྣམས་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ་གོས་ངུར་སྨྲིག་བགོས་ནས་དད་པ་ཡང་དག་པ་ཁོ་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ནས་ཚངས་པར་སྤྱོད་པའི་མཐའ་བླ་ན་མེད་པ་ཚེ་དེ་ཉིད་ལ་རང་གི་མངོན་པར་ཤེས་པས་མངོན་སུམ་དུ་བྱས་ཏེ་རྫོགས་པར་བྱས་ནས་སྐྱེ་བ་ཟད་དོ།
en: Now Nanda, the herdsman, will come, having entrusted the cattle to the owners, and will actualize and accomplish the supreme end of the pure life for which the sons of noble families go forth from their homes into homelessness with true faith, having shaved off their hair and beards and donned saffron robes, and understand: ‘My births have been exhausted.

source: །འདི་ལས་སྲིད་པ་གཞན་མི་ཤེས་སོ་ཞེས་གོ་བར་བྱེད་པར་འགྱུར་རོ།
en: I will not know another existence after this one.’ ”

source: །དེ་ནས་དུས་གཞན་ཞིག་ན་གནག་རྫི་དགའ་བོས་བདག་པོ་རྣམས་ལ་གནག་གཏད་ནས་འཁོར་ལྔ་བརྒྱ་དང་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་ནས་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: After that, Nanda, the herdsman, having entrusted the cattle to the owners, did go to the Blessed One, with five hundred people around him.

source: །བཙུན་པ་བདག་གིས་བདག་པོ་རྣམས་ལ་གནག་རྣམས་གཏད་ལགས་ཏེ།
en: Having arrived, he said to the Blessed One, “O Honored One, I have entrusted the cattle to the owners.

source: བཙུན་པ་བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་བསྙེན་པར་རྫོགས་པ་དགེ་སློང་གི་དངོས་པོ་འཐོབ་པ་ལྟ་ན་བདག་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཚངས་པར་སྤྱོད་པ་སྤྱད་པར་བགྱིའོ།
en: O Honored One, I wish to go forth and be ordained a monk in the well-taught Dharma and Vinaya. I will lead the pure life in the presence of the Blessed One.”

source: །ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་གནག་རྫི་དགའ་བོ་འཁོར་ལྔ་བརྒྱ་དང་རབ་ཏུ་བྱུང་བ་དང་བསྙེན་པར་རྫོགས་པ་དགེ་སློང་གི་དངོས་པོ་ཐོབ་པར་གྱུར་ཏོ།
en: In the well-taught Dharma and Vinaya, Nanda, the herdsman, went forth and was ordained a monk with the five hundred people around him.

source: །དེ་ལྟར་རབ་ཏུ་བྱུང་བ་དང་། ཚེ་དང་ལྡན་པ་དེ་ཞེས་བྱ་བ་ནས་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བར་གྱུར་ཅེས་བྱ་བའི་བར་སྔ་མ་བཞིན་དུའོ།
en: Having gone forth, the Honored One . . . became an arhat whose mind had been completely liberated.

source: །ཆོས་ཉིད་ཀྱིས་ལྷའི་བུའམ་ལྷའི་བུ་མོ་སྐྱེས་ནས་རིང་པོར་མ་ལོན་པར་སེམས་གསུམ་སྐྱེ་བར་འགྱུར་ཏེ། གང་ནས་ཤི་འཕོས་པ་དང་། གང་དུ་སྐྱེས་པ་དང་། ལས་གང་གིས་ཡིན་པའོ།
en: It is natural for gods or goddesses to give rise to three thoughts just after birth: namely, where they died, where they were reborn, and by what action.

source: །སྔོན་སྦལ་པ་བྱེད་བྱེད་པའི་ལྷའི་བུས་བལྟས་ན་དུད་འགྲོ་དག་ནས་ཤི་འཕོས་པ་དང་། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་སུ་སྐྱེས་པ་དང་། བཅོམ་ལྡན་འདས་ལ་སེམས་མངོན་པར་དད་པས་ཡིན་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: The god who had once been the frog observed that he had died in the animal world, that he had been born among the gods attendant on the Four Great Kings, and that this was because he had gained faith in the Blessed One.

source: བདག་གིས་གང་ཡང་ཞག་ལོན་ནས་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་འགྲོ་བ་ནི་བདག་གི་ཆ་མ་ཡིན་གྱིས། མལ་བདག་གིས་ཞག་མ་ལོན་པ་ཁོ་ནར་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་འགྲོའོ་སྙམ་མོ།
en: Then he thought, “Since it would not be appropriate for me to let any days pass before going to see and serve the Blessed One, I will by all means go now to see and serve the Blessed One before any days have passed.”

source: །དེ་ནས་སྔོན་སྦལ་པ་བྱེད་བྱེད་པའི་ལྷའི་བུས་རྣ་ཆ་དྲི་མ་མེད་པ་གཡོ་བ་ཐོགས་ནས་ཞེས་བྱ་བ་ནས་གང་གཱའི་འགྲམ་ཐམས་ཅད་སྣང་བ་རྒྱ་ཆེན་པོས་གསལ་བར་བྱས་ཏེ་བཅོམ་ལྡན་འདས་ལ་མེ་ཏོག་གིས་གཏོར་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཆོས་མཉན་པའི་ཕྱིར་འདུག་གོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: Then the god who had once been the frog put on untarnished, swinging earrings, . . . illuminating the entire neighborhood of the bank of the Ganges with a vast display of light, scattered the flowers for the Blessed One, and sat down in front of the Blessed One in order to hear the Dharma.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྔོན་སྦལ་པ་བྱེད་བྱེད་པའི་ལྷའི་བུའི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་། ཁམས་དང་། རང་བཞིན་མཁྱེན་ནས་དེ་དང་མཐུན་པ་འཕགས་པའི་བདེན་པ་བཞི་སོ་སོར་རྟོགས་པར་འགྱུར་བའི་ཆོས་བཤད་པ་མཛད་དེ།
en: The Blessed One knew the thinking, proclivity, disposition, and nature of the god who had once been the frog and preached the Dharma that was appropriate for the god and that caused him to penetrate the four truths of the noble ones.

source: དེ་ཐོས་པ་ཞེས་བྱ་བ་ནས་ཐོག་མ་མེད་པའི་དུས་ནས་བསགས་པའི་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་ཉི་ཤུ་མཐོ་བ་ཡེ་ཤེས་ཀྱི་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བགྱིས་ཏེ། བཙུན་པ་བདག་ནི་འཕགས་སོ། །མངོན་པར་འཕགས་སོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: When the god had heard the Dharma, with the vajra of knowledge he leveled the twenty high peaks of the mountain chain of the false view of individuality that had been accumulated since beginningless time, and actualized the fruit of stream-entry. . . . “. . . O Honored One, I have been exalted, truly exalted.

source: །བདག་བཅོམ་ལྡན་འདས་དང་ཆོས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་སྐྱབས་སུ་མཆི་ལགས་ཀྱིས། བདག་དགེ་བསྙེན་དུ་གཟུང་དུ་གསོལ།
en: Since I seek refuge in the Blessed One, the Dharma, and the community of monks, please accept me as a lay brother.

source: །དེ་ནས་སྔོན་སྦལ་པ་བྱེད་བྱེད་པའི་ལྷའི་བུ་ཚོང་པ་ཁེ་སྤོགས་རྙེད་པ་ལྟ་བུ་དང་། ཞིང་པ་ལོ་ཏོག་ལེགས་པ་ལྟ་བུ་དང་། དཔའ་བོ་གཡུལ་ལས་རྣམ་པར་རྒྱལ་བ་ལྟ་བུ་དང་། ནད་པ་ནད་ཐམས་ཅད་ལས་ཐར་བ་ལྟ་བུར་འབྱོར་པ་གང་གིས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འོངས་པའི་འབྱོར་པ་དེ་ཉིད་དང་རང་གི་གནས་སུ་སོང་ངོ་།
en: Thereupon, like a merchant who had obtained merchandise, like a farmer who had gotten a bumper crop, like a warrior who had won a battle, like a patient who had been cured of every disease, the god who had once been the frog went to his house with the same majesty with which he had come into the presence of the Blessed One.

source: །དགེ་སློང་རྣམས་ནམ་གྱི་ཆ་སྟོད་དང་ནམ་གྱི་ཆ་སྨད་ལ་མི་ཉལ་བར་སྦྱོར་བ་ལ་བརྩོན་ཞིང་གནས་པ་དེ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ན་སྣང་བ་རྒྱ་ཆེན་པོ་མཐོང་ངོ་། །དེ་མཐོང་ནས་ཀྱང་ཐེ་ཚོམ་དུ་གྱུར་ནས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། ཅི་ལགས།
en: As the monks were exerting themselves in the maintenance of vigilance during the first and last watches of the night, when they saw the vast display of light appear before the Blessed One, they were perplexed and asked the Blessed One, “What was that?

source: བཅོམ་ལྡན་འདས་མ་དང་བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་སླད་དུ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པའམ། ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་ནམ། འཇིག་རྟེན་སྐྱོང་བ་བཞི་མཆིས་སམ།
en: O Blessed One, did Brahmā, the ruler of the Sahā World, or Śakra, Lord of the Gods, or the Four Protectors of the World come to see the Blessed One last night?”

source: དགེ་སློང་དག་ང་བལྟ་བའི་ཕྱིར་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་འོངས་པ་ཡང་མ་ཡིན། ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་ཡང་མ་ཡིན། འཇིག་རྟེན་སྐྱོང་བ་བཞི་ཡང་མ་ཡིན་གྱི།
en: “Monks, it was not Brahmā, the ruler of the Sahā World, or Śakra, Lord of the Gods, or the Four Protectors of the World who came to see me.

source: འོན་ཀྱང་གནག་རྫི་དགའ་བོའི་ཁར་བས་སྦལ་པ་བརྫིས་ཏེ་གནད་རྣམས་ཀྱང་ཆད་ལ་ཐུག །ཚིག་རྣམས་ཀྱང་བྱེ་ལ་ཐུག་པ་དང་། གནག་རྫི་དགའ་བོའི་གཏམ་བར་ཆད་པར་འགྱུར་རོ་སྙམ་ནས།
en: A frog, while he was squashed by the stick of Nanda, the herdsman, having had his vital organs cut, and been split at his joints, did not move or utter a cry, thinking that if he did so, he would prevent Nanda, the herdsman, from listening to the discourse.

source: མི་གཡོ་ཞིང་སྒྲ་མ་ཕྱུང་བར་འདུག་ནས་ང་ལ་སེམས་མངོན་པར་དད་པར་བྱས་ནས་ཤི་བ་དང་། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་སུ་སྐྱེས་པ་དེ་མདང་ང་ལ་བལྟ་བའི་ཕྱིར་འོངས་ནས།
en: His mind filled with faith in me, he died and was born among the gods attendant on the Four Great Kings.

source: ངས་དེ་ལ་ཆོས་བཤད་ནས་བདེན་པ་མཐོང་སྟེ་རང་གི་གནས་སུ་སོང་བ་ཡིན་ནོ།
en: He came to see me last night, saw the truths when I preached Dharma to him, and went to his house.” B. The Former Lives of Nanda and the Frog

source: །དགེ་སློང་རྣམས་ཐེ་ཚོམ་སྐྱེས་ནས་ཐེ་ཚོམ་ཐམས་ཅད་གཅོད་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་གནག་རྫི་དགའ་བོ་དང་འཁོར་ལྔ་བརྒྱས་ལས་ཅི་ཞིག་བགྱིས་ན་གནག་རྫི་དག་གི་ནང་དུ་སྐྱེས་ཤིང་། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བགྱིས་པ་ལགས།
en: The monks, feeling doubtful, inquired of the Buddha, the Blessed One, the one who severs all doubts, “O Honored One, what karma did Nanda, the herdsman, and the five hundred people around him create that matured to cause them to be born among herdsmen, go forth in the teachings of the Blessed One, abandon all the defilements, and actualize the state of an arhat?

source: སྔོན་སྦལ་པ་བྱེད་བྱེད་པའི་ལྷའི་བུས་ལས་ཅི་ཞིག་བགྱིས་ན། དེས་ན་སྦལ་པར་སྐྱེས་པར་གྱུར་ཅིང་བདེན་པ་མཐོང་བར་བགྱིས་ལགས།
en: What karma did the god who had once been a frog create that matured to cause him to be born among frogs and then see the truths?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་དེ་ཉིད་ཀྱིས་ལས་བྱས་ཤིང་བསགས་ལ་ཚོགས་རྙེད་པ་ཞེས་བྱ་བ་ནས།
en: The Blessed One said, “Monks, the actions were performed and accumulated by him, . . . “. . .

source: །དགེ་སློང་དག་སྔོན་བྱུང་བ་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན་སྟོན་པ་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ་ཞེས་བྱ་བ་ནས། དེ་བཱ་རཱ་ཎ་སཱིའི་གྲོང་ཁྱེར་ན་དྲང་སྲོང་སྨྲ་བ་རི་དགས་ཀྱི་ནགས་ན་ཉེ་བར་རྟེན་ཅིང་བཞུགས་སོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “Monks, once, in this fortunate eon, when people’s lives were twenty thousand years long, there appeared in the world a teacher named Kāśyapa, . . . . He stayed in the Ṛṣivadana Deer Park near the city of Vārāṇasī.

source: །དེའི་གསུང་རབ་ལ་གནག་རྫི་དགའ་བོ་རབ་ཏུ་བྱུང་བ་སྡེ་སྣོད་གསུམ་པ་ཆོས་སྨྲ་བ་རིགས་པ་དང་གྲོལ་བའི་སྤོབས་པ་ཅན་འཁོར་ལྔ་བརྒྱ་པ་རྩོད་པའི་ཆོས་ལ་མཁས་པ་ཞིག་སྟེ།
en: “In the teachings of that buddha, this Nanda, the herdsman, went forth and became a preacher of Dharma well versed in the three divisions of the canon, of eloquence tied to reason and free from obstacles, possessing five hundred attendants, and skillful in dealing with disputes.

source: དེ་དགེ་འདུན་གྱི་རྩོད་པ་བྱུང་ཞིང་བྱུང་བ་རྣམས་ཞི་བར་བྱེད་པ་དང་། དེ་ན་དགེ་སློང་ཁེངས་པ་ང་རྒྱལ་ཅན་གཉིས་ཤིག་ལན་འགའ་ཡང་དེའི་དྲུང་དུ་མི་འདོང་ངོ་།
en: Every time a dispute arose in the community, he settled it. But there were two haughty, proud monks who had never gone to him.

source: །དུས་གཞན་ཞིག་ན་དེ་གཉིས་ཕན་ཚུན་དུ་རྩོད་པ་བྱུང་ནས་དོན་དེའི་ཕྱིར་དེ་གཉིས་དེའི་དྲུང་དུ་དོང་ནས་རྐང་པ་ལ་ཕྱག་བྱས་ཏེ་སྨྲས་པ། བདག་ཅག་གཉིས་ལ་འདི་དང་འདི་ལྟ་བུའི་རྩོད་པ་བྱུང་ན་ཞི་བར་མཛད་དུ་གསོལ།
en: Later, a dispute arose between these two; because of this matter, they went to him, paid homage at his feet, and requested, ‘Since such-and-such a dispute has arisen between the two of us, please settle it.’

source: དེས་བསམས་པ། གལ་ཏེ་བདག་གིས་འདི་གཉིས་ཀྱི་རྩོད་པ་དེང་ཁོ་ན་ཞི་བར་བྱས་ན་རག་མ་ལས་པས་འདི་གཉིས་ཕྱིས་འོང་བར་མི་འགྱུར་རོ་སྙམ་ནས། དེས་དགེ་འདུན་ཐམས་ཅད་བསོགས་ནས་རྩོད་པ་དེ་དགེ་འདུན་གྱི་ནང་དུ་གླེངས་ནས་ཆད་པར་ནི་མ་བྱས་སོ།
en: “He thought, ‘If I settle their dispute today, then these two will no longer depend on me, and so they will not come to me afterward.’ He gathered the entire community and raised the dispute in the middle of the community, but he did not issue any decision.

source: །ཕྱི་དེ་ཉིན་ཡང་དེ་ལ་རི་འོར་དུ་དོགས་པ་ཞིག་བྱུང་ནས་དེ་དེར་སོང་བ་དང་། དེ་ནས་དེ་གཉིས་ཀྱིས་ཐོགས་སོ་ཞེས་དགེ་འདུན་གྱི་ནང་དུ་རྩོད་པ་དེ་གླེངས་ནས་དེ་ནས་དགེ་འདུན་གྱིས་ཞི་བར་བྱས་སོ།
en: The next day he went to a certain hamlet, for he had some business there. Then the two monks themselves raised the dispute in the middle of the community lest the settlement of it be delayed, and it was settled by the community.

source: །ཇི་ཙམ་ན་དགེ་སློང་སྡེ་སྣོད་གསུམ་པ་དེ་རི་འོར་དེ་ནས་འོངས་ཏེ་ལམ་གྱིས་དུབ་པ་བསལ་ནས་ལྷན་ཅིག་གནས་པ་དང་ཉེ་གནས་རྣམས་ལ་དྲིས་པ་རེ་ཞིག་རྩོད་པ་དང་རྩོད་ཟླ་གཉིས་མི་འོང་ངམ།
en: The monk well versed in the three divisions of the canon returned from the hamlet. After he had rested well from the journey, he asked his co-resident monks and pupils, ‘Did the two, the disputer and his opponent, not come?’

source: དེ་རྣམས་ཀྱིས་སྨྲས་པ། མཁན་པོ་དེ་གཉིས་ཀྱི་རྩོད་པ་དེ་ཞི་བར་བགྱིས་ལགས་སོ།
en: “ ‘O master, the dispute has been settled,’ they answered.

source: །སུ་ཞིག་གིས་ཞི་བར་བྱས།
en: “ ‘Who settled it?’

source: དགེ་འདུན་གྱིས་སོ།
en: “ ‘The community did.’

source: །ཇི་ལྟར་བྱས།
en: “ ‘How did they do it?’

source: དེ་རྣམས་ཀྱིས་རྒྱས་པར་སྨྲས་པ་དང་། དེས་ངག་རྩུབ་པོའི་ལས་བྱུང་བ།
en: “When they had explained the matter in detail, he created the karma of harsh speech:

source: ཚེ་དང་ལྡན་པ་དག་མི་ཤེས་ཏེ།
en: ‘The venerable ones are ignorant:

source: ཇི་ལྟར་གནག་རྫི་རྣམས་ཀྱི་ལྟར་རྩོད་པ་དེ་ཞི་བར་བྱས་སོ།
en: they settled that dispute just as herdsmen do!’

source: །དེ་རྣམས་ཀྱིས་ཀྱང་མཁན་པོ་དེ་དེ་བཞིན་ཏེ།
en: “They, too, agreed with him: ‘True, O master!

source: ཇི་ལྟར་གནག་རྫི་རྣམས་ཀྱི་ལྟར་རྩོད་པ་ཞི་བར་བགྱིས་སོ་ཞེས་མཐུན་པར་སྨྲས་སོ།
en: They settled the dispute just as herdsmen do.’

source: དེའི་ཚེ་དེའི་དུས་ན་དགེ་སློང་སྡེ་སྣོད་གསུམ་པ་གང་ཡིན་པ་དེ་ནི་གནག་རྫི་དགའ་བོ་འདི་ཉིད་ཡིན་ནོ།
en: That one who was the monk well versed in the three divisions of the canon at that time, on that occasion, was indeed this herdsman Nanda.

source: །དེའི་ལྷན་ཅིག་གནས་པ་དང་ཉེ་གནས་ལྔ་བརྒྱ་པོ་གང་ཡིན་པ་དེ་དག་ནི་གནག་རྫི་ལྔ་བརྒྱ་པོ་འདི་དག་ཉིད་ཡིན་ནོ།
en: Those who were his five hundred co-resident monks and pupils are indeed these five hundred herdsmen.

source: །གང་ཡང་འདིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ལ་གནག་རྫི་ཞེས་བྱ་བའི་ཚིག་སྨྲས་ཤིང་། ལྷན་ཅིག་གནས་པ་དང་ཉེ་གནས་རྣམས་ཀྱིས་ཀྱང་མཐུན་པར་སྨྲས་པས། ལས་དེའི་རྣམ་པར་སྨིན་པས་ཚེ་རབས་ལྔ་བརྒྱར་འཁོར་ལྔ་བརྒྱ་དང་གནག་རྫི་རྣམས་སུ་སྐྱེས་པར་གྱུར་ཏོ།
en: Because of the maturation of the karma created by them, namely, his saying the word ‘herdsmen’ to the community of disciples of the Perfectly Awakened One Kāśyapa, and the agreeing of his co-resident monks and pupils, he and the five hundred attendants were born among herdsmen for five hundred lives.

source: །གང་འདིས་བཀླགས་ཤིང་བཏོན་པས་ཕུང་པོ་ལ་མཁས་པ་དང་། ཁམས་ལ་མཁས་པ་དང་། སྐྱེ་མཆེད་ལ་མཁས་པ་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལ་མཁས་པ་དང་། གནས་དང་གནས་མ་ཡིན་པ་ལ་མཁས་པར་བྱས་པས། ད་ལྟར་འདི་འཁོར་ལྔ་བརྒྱ་དང་ངའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་མངོན་སུམ་དུ་བྱས་སོ།
en: And since he was well versed in the aggregates, elements, sense spheres, dependent origination, and what is proper and what is improper through recitation and repetition, he with the five hundred people around him went forth in my teaching, abandoned all the defilements, and actualized the state of an arhat.

source: །དགེ་སློང་དག་སྔོན་སྦལ་པ་བྱེད་བྱེད་པའི་ལྷའི་བུ་ཡང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ཁོ་ནའི་གསུང་རབ་ལ་དགེ་སློང་སྤོང་བ་པ་ཞིག་ཏུ་གྱུར་ཏེ།
en: “Monks, furthermore, the god who had once been a frog was a meditator monk in the teachings of the Perfectly Awakened One Kāśyapa.

source: ལྗོངས་རྒྱུ་ཞིང་སོང་བ་དང་རི་འོར་ཞིག་ན་གཙུག་ལག་ཁང་ཞིག་ཡོད་པ་དེར་སོན་ཏོ།
en: One time, he traveled to a monastery near a hamlet.

source: །དེ་མཚན་མོའི་ཐུན་དང་པོ་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་ཡིད་ལ་བྱ་བ་གོམས་པར་བྱ་བར་བརྩམས་པ་དང་། ཇི་ཙམ་ན་འདོན་པ་བྱེད་པའི་དགེ་སློང་རྣམས་ཁ་ཏོན་བྱེད་པ་དང་། བསམ་གཏན་གྱི་ཚེར་མ་ནི་སྒྲ་ཡིན་པས་དེ་སྒྲས་སེམས་རྩེ་གཅིག་པ་ཉིད་མ་བཏུབ་ནས་དེས་བསམས་པ།
en: In the first watch of the night, he sat down with his legs crossed and began to practice concentration of the mind. At that time reciter monks were reciting. Since dhyāna is disturbed by voices, he was unable to concentrate his mind on a single point due to the voices. He thought, ‘Let them recite.

source: འདི་དག་ཁ་ཏོན་ཟེར་དུ་ཆུག་གུང་ཐུན་ལ་འདུག་པར་བྱའོ་སྙམ་ནས་གུང་ཐུན་ལ་ལངས་ཏེ་འདུག་པ་དང་། ཇི་ཙམ་ན་དགེ་སློང་གཞན་དག་ཁ་ཏོན་བྱེད་ནས་དེས་བསམས་པ།
en: I will meditate in the middle watch.’ When he got up in the middle watch and sat down, other monks were reciting.

source: ཐུན་ཐ་མ་ལ་འདུག་པར་བྱའོ་སྙམ་ནས། དེ་ཐུན་ཐ་མ་ལ་ལངས་ཏེ་འདུག་པ་དང་། ཇི་ཙམ་ན་གཞན་དག་ཁ་ཏོན་བྱེད་ནས་དེ་འདོད་ཆགས་དང་བྲལ་བ་མ་ཡིན་པས་ཀུན་ནས་དཀྲིས་པ་དྲག་པོ་སྐྱེས་ནས་དེས་སྨྲས་པ། འོད་སྲུང་གི་དགེ་སྦྱོང་འདི་རྣམས་ནི་སྦལ་པ་བཞིན་མཚན་ཐོག་ཐག་སྒྲ་འབྱིན་ཏོ་ཞེས་བྱས་སོ།
en: He thought, ‘I will meditate in the last watch.’ When he got up in the last watch and sat down, other monks were reciting. Since he was not free from desire, he said in fierce anger, ‘These śramaṇas of Kāśyapa were noisy as frogs all night long!’

source: དགེ་སློང་སྤོང་བ་པ་གང་ཡིན་པ་དེ་ནི་སྔོན་སྦལ་པ་བྱེད་བྱེད་པའི་ལྷའི་བུ་འདི་ཉིད་ཡིན་ཏེ།
en: That one who was the meditator monk at that time, on that occasion, was indeed this god who had once been a frog.

source: གང་ཡང་འདིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་ཉན་ཐོས་རྣམས་ལ་སྦལ་པ་ཞེས་ཚིག་ཏུ་སྨྲས་པས་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཚེ་རབས་ལྔ་བརྒྱར་སྦལ་པར་སྐྱེས་པར་གྱུར་ཏེ། ད་ལྟའི་བར་དུ་ཡང་སྦལ་པར་སྐྱེས་པ་ཡིན་ནོ།
en: Because of the maturation of the karma created by him, namely, his saying the word ‘frogs’ to the disciples of the Perfectly Awakened One Kāśyapa, he was born among frogs for five hundred lives, and now he was still born among frogs.

source: །གང་ཡང་ང་ལ་སེམས་མངོན་པར་དད་པར་བྱས་པས་དེས་ན་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་སུ་སྐྱེས་པར་གྱུར་ཏོ།
en: Because he had gained faith, he was reborn among the gods attendant on the Four Great Kings.

source: །གང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ལས་ཚངས་པར་སྤྱོད་པ་སྤྱད་པས་དེས་ན་ད་ལྟར་བདེན་པ་མཐོང་བར་བྱས་སོ།
en: Because he led the pure life in the presence of the Perfectly Awakened One Kāśyapa, here he saw the truths.

source: །དགེ་སློང་དག་དེ་ལྟ་བས་ན་གཅིག་ཏུ་གནག་པ་རྣམས་ཀྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ནི་གཅིག་ཏུ་གནག་པ་ཡིན་ལ་ཞེས་བྱ་བ་ནས་བརྩོན་པར་བྱ་སྟེ།
en: “Therefore, monks, the maturation of entirely negative actions is entirely negative . . . you should seek . . . .

source: དགེ་སློང་དག་ཁྱེད་ཀྱིས་དེ་ལྟ་བུ་ལ་བསླབ་པར་བྱའོ། །ཞེས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ཏོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: Monks, that is how you must train.” Thus spoke the Blessed One. VII.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཆུ་བོ་གང་གཱ་རྒལ་བ་དང་། དེ་ན་ངང་པ་དང་། ཉ་དང་རུ་སྦལ་ལྔ་བརྒྱས་བསྐོར་ཏེ་བསྐོར་བ་བྱས་སོ།
en: The Ganges A. Haṃsas, Fish, and Turtles Thereupon the Blessed One crossed the Ganges. There five hundred haṃsas, fish, and turtles surrounded and circumambulated him.

source: །དེ་རྣམས་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིག་གསུམ་གྱི་ཆོས་བཤད་པ་མཛད་དེ།
en: The Blessed One preached the Dharma to them that consists of three phrases:

source: བཞིན་བཟངས་དག་འདི་ལྟར་འདུ་བྱེད་ཐམས་ཅད་ནི་མི་རྟག་པའོ།
en: “Sirs, all conditioned things are impermanent;

source: །ཆོས་ཐམས་ཅད་ནི་བདག་མེད་པའོ།
en: all phenomena are selfless;

source: །མྱ་ངན་ལས་འདས་པ་ནི་ཞི་བ་ཡིན་པས་ང་ལ་སེམས་མངོན་པར་དད་པར་གྱིས་ལ། ཅི་ནས་ཀྱང་དུད་འགྲོའི་སྐྱེ་གནས་ལ་འདོད་ཆགས་དང་བྲལ་བར་གྱིས་ཤིག །དེ་རྣམས་འདི་སྙམ་དུ་སེམས་ཏེ།
en: and nirvāṇa is peace. Make your mind filled with faith in me, and by all means become free from desire for rebirth in the animal world.”

source: གང་བདག་ཅག་གིས་བཅོམ་ལྡན་འདས་ལས་ཚིག་གསུམ་གྱི་ཆོས་ཐོས་ནས་ཁ་ཟས་ཟ་བར་བྱེད་པ་ནི་བདག་ཅག་གི་ཆ་མ་ཡིན་ནོ་སྙམ་ནས།
en: “It would not be appropriate for us to eat food in front of the Blessed One after having heard the Dharma that consists of three phrases,” they thought, and so they fasted.
